---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition.OutOfPlaneBendDiameter
source: html/d1fe3a4b-998e-f726-ef0d-befe41cb01f8.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition.OutOfPlaneBendDiameter Property

Bend diameter to be applied to the connector segments.

## Syntax (C#)
```csharp
public double OutOfPlaneBendDiameter { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for outOfPlaneBendDiameter must be greater than 0 and no more than 30000 feet.